In [ ]:
import pandas as pd 
import numpy as np
from sklearn import svm

In [ ]:
from sklearn.preprocessing import LabelEncoder, StandardScaler
from sklearn.model_selection import train_test_split

In [ ]:
from sklearn.impute import SimpleImputer

In [ ]:
! pip install -q kaggle

In [ ]:
 from google.colab import files 
 files.upload()

Saving kaggle.json to kaggle.json

{'kaggle.json': b'{"username":"muhammadabualhamd","key":"e1cc77ee9223a9e0811e29aa77c55ac9"}'}

In [ ]:
! mkdir ~/.kaggle
! cp kaggle.json ~/.kaggle/

In [ ]:
! chmod 600 ~/.kaggle/kaggle.json

In [ ]:
! kaggle competitions download -c titanic

Warning: Looks like you're using an outdated API Version, please consider updating (server 1.5.12 / client 1.5.4)
Downloading gender_submission.csv to /content
  0% 0.00/3.18k [00:00<?, ?B/s]
100% 3.18k/3.18k [00:00<00:00, 5.20MB/s]
Downloading train.csv to /content
  0% 0.00/59.8k [00:00<?, ?B/s]
100% 59.8k/59.8k [00:00<00:00, 54.5MB/s]
Downloading test.csv to /content
  0% 0.00/28.0k [00:00<?, ?B/s]
100% 28.0k/28.0k [00:00<00:00, 27.7MB/s]

In [ ]:
df = pd.read_csv('/content/train.csv')

In [ ]:
df.head()

   PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0            1         0       3  ...   7.2500   NaN         S
1            2         1       1  ...  71.2833   C85         C
2            3         1       3  ...   7.9250   NaN         S
3            4         1       1  ...  53.1000  C123         S
4            5         0       3  ...   8.0500   NaN         S

[5 rows x 12 columns]

In [ ]:
df.describe()

       PassengerId    Survived      Pclass  ...       SibSp       Parch        Fare
count   891.000000  891.000000  891.000000  ...  891.000000  891.000000  891.000000
mean    446.000000    0.383838    2.308642  ...    0.523008    0.381594   32.204208
std     257.353842    0.486592    0.836071  ...    1.102743    0.806057   49.693429
min       1.000000    0.000000    1.000000  ...    0.000000    0.000000    0.000000
25%     223.500000    0.000000    2.000000  ...    0.000000    0.000000    7.910400
50%     446.000000    0.000000    3.000000  ...    0.000000    0.000000   14.454200
75%     668.500000    1.000000    3.000000  ...    1.000000    0.000000   31.000000
max     891.000000    1.000000    3.000000  ...    8.000000    6.000000  512.329200

[8 rows x 7 columns]

In [ ]:
df.isna().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [ ]:
df = df.drop(columns = ['Cabin', 'Name','PassengerId','Ticket'])

In [ ]:
df.head()

   Survived  Pclass     Sex   Age  SibSp  Parch     Fare Embarked
0         0       3    male  22.0      1      0   7.2500        S
1         1       1  female  38.0      1      0  71.2833        C
2         1       3  female  26.0      0      0   7.9250        S
3         1       1  female  35.0      1      0  53.1000        S
4         0       3    male  35.0      0      0   8.0500        S

In [ ]:
df.isna().sum()

Survived      0
Pclass        0
Sex           0
Age         177
SibSp         0
Parch         0
Fare          0
Embarked      2
dtype: int64

In [ ]:
for col in df:
  print(col + '\t' + str(df[col].nunique()))

Survived	2
Pclass	3
Sex	2
Age	88
SibSp	7
Parch	7
Fare	248
Embarked	3

In [ ]:
df.describe()

         Survived      Pclass         Age       SibSp       Parch        Fare
count  891.000000  891.000000  714.000000  891.000000  891.000000  891.000000
mean     0.383838    2.308642   29.699118    0.523008    0.381594   32.204208
std      0.486592    0.836071   14.526497    1.102743    0.806057   49.693429
min      0.000000    1.000000    0.420000    0.000000    0.000000    0.000000
25%      0.000000    2.000000   20.125000    0.000000    0.000000    7.910400
50%      0.000000    3.000000   28.000000    0.000000    0.000000   14.454200
75%      1.000000    3.000000   38.000000    1.000000    0.000000   31.000000
max      1.000000    3.000000   80.000000    8.000000    6.000000  512.329200

In [ ]:
Y = df['Survived']
X = df.drop(['Survived'],axis=1)
# another way of splitting the data
# Y = df.iloc[:,0]
# x = df.iloc[:,1:]

In [ ]:
print(Y)

0      0
1      1
2      1
3      1
4      0
      ..
886    0
887    1
888    0
889    1
890    0
Name: Survived, Length: 891, dtype: int64

In [ ]:
print(X)

     Pclass     Sex   Age  SibSp  Parch     Fare Embarked
0         3    male  22.0      1      0   7.2500        S
1         1  female  38.0      1      0  71.2833        C
2         3  female  26.0      0      0   7.9250        S
3         1  female  35.0      1      0  53.1000        S
4         3    male  35.0      0      0   8.0500        S
..      ...     ...   ...    ...    ...      ...      ...
886       2    male  27.0      0      0  13.0000        S
887       1  female  19.0      0      0  30.0000        S
888       3  female   NaN      1      2  23.4500        S
889       1    male  26.0      0      0  30.0000        C
890       3    male  32.0      0      0   7.7500        Q

[891 rows x 7 columns]

In [ ]:
# le = LabelEncoder()

In [ ]:
# le.fit_transform(X['Sex'])

In [ ]:
embarked_mapping = {"S": 1, "C": 2, "Q": 3}
sex_mapping = {"male": 0, "female": 1}

X['Embarked'] = X['Embarked'].map(embarked_mapping) 
X['Sex'] = X['Sex'].map(sex_mapping)

In [ ]:
X

     Pclass  Sex   Age  SibSp  Parch     Fare  Embarked
0         3    0  22.0      1      0   7.2500       1.0
1         1    1  38.0      1      0  71.2833       2.0
2         3    1  26.0      0      0   7.9250       1.0
3         1    1  35.0      1      0  53.1000       1.0
4         3    0  35.0      0      0   8.0500       1.0
..      ...  ...   ...    ...    ...      ...       ...
886       2    0  27.0      0      0  13.0000       1.0
887       1    1  19.0      0      0  30.0000       1.0
888       3    1   NaN      1      2  23.4500       1.0
889       1    0  26.0      0      0  30.0000       2.0
890       3    0  32.0      0      0   7.7500       3.0

[891 rows x 7 columns]

In [ ]:
sc = StandardScaler()

In [ ]:
X['Fare'] = sc.fit_transform(np.reshape(X['Fare'].values,(-1,1)))

In [ ]:
X

     Pclass  Sex   Age  SibSp  Parch      Fare  Embarked
0         3    0  22.0      1      0 -0.502445       1.0
1         1    1  38.0      1      0  0.786845       2.0
2         3    1  26.0      0      0 -0.488854       1.0
3         1    1  35.0      1      0  0.420730       1.0
4         3    0  35.0      0      0 -0.486337       1.0
..      ...  ...   ...    ...    ...       ...       ...
886       2    0  27.0      0      0 -0.386671       1.0
887       1    1  19.0      0      0 -0.044381       1.0
888       3    1   NaN      1      2 -0.176263       1.0
889       1    0  26.0      0      0 -0.044381       2.0
890       3    0  32.0      0      0 -0.492378       3.0

[891 rows x 7 columns]

In [ ]:
X

     Pclass  Sex   Age  SibSp  Parch      Fare  Embarked
0         3    0  22.0      1      0 -0.502445       1.0
1         1    1  38.0      1      0  0.786845       2.0
2         3    1  26.0      0      0 -0.488854       1.0
3         1    1  35.0      1      0  0.420730       1.0
4         3    0  35.0      0      0 -0.486337       1.0
..      ...  ...   ...    ...    ...       ...       ...
886       2    0  27.0      0      0 -0.386671       1.0
887       1    1  19.0      0      0 -0.044381       1.0
888       3    1   NaN      1      2 -0.176263       1.0
889       1    0  26.0      0      0 -0.044381       2.0
890       3    0  32.0      0      0 -0.492378       3.0

[891 rows x 7 columns]

In [ ]:
# df['Embarked'].mode()[0]

In [ ]:
imputer = SimpleImputer(missing_values=np.nan,strategy='most_frequent')

X['Embarked'] = imputer.fit_transform(np.reshape(X['Embarked'].values, (-1,1)))

In [ ]:
X['Age'] = imputer.fit_transform(np.reshape(X['Age'].values, (-1,1))) #maybe use pd.DataFrame()

In [ ]:
X.isna().sum()

Pclass      0
Sex         0
Age         0
SibSp       0
Parch       0
Fare        0
Embarked    0
dtype: int64

In [ ]:
X

     Pclass  Sex   Age  SibSp  Parch      Fare  Embarked
0         3    0  22.0      1      0 -0.502445       1.0
1         1    1  38.0      1      0  0.786845       2.0
2         3    1  26.0      0      0 -0.488854       1.0
3         1    1  35.0      1      0  0.420730       1.0
4         3    0  35.0      0      0 -0.486337       1.0
..      ...  ...   ...    ...    ...       ...       ...
886       2    0  27.0      0      0 -0.386671       1.0
887       1    1  19.0      0      0 -0.044381       1.0
888       3    1  24.0      1      2 -0.176263       1.0
889       1    0  26.0      0      0 -0.044381       2.0
890       3    0  32.0      0      0 -0.492378       3.0

[891 rows x 7 columns]

In [ ]:
for col in df:
  print(col + '\t' + str(df[col].nunique()))

Survived	2
Pclass	3
Sex	2
Age	88
SibSp	7
Parch	7
Fare	248
Embarked	3

In [ ]:
X['Age'] = sc.fit_transform(np.reshape(X['Age'].values,(-1,1)))

In [ ]:
df_test = pd.read_csv('/content/test.csv')

In [ ]:
df_test2 = pd.read_csv('/content/test.csv')

In [ ]:
df_test

     PassengerId  Pclass  ... Cabin Embarked
0            892       3  ...   NaN        Q
1            893       3  ...   NaN        S
2            894       2  ...   NaN        Q
3            895       3  ...   NaN        S
4            896       3  ...   NaN        S
..           ...     ...  ...   ...      ...
413         1305       3  ...   NaN        S
414         1306       1  ...  C105        C
415         1307       3  ...   NaN        S
416         1308       3  ...   NaN        S
417         1309       3  ...   NaN        C

[418 rows x 11 columns]

In [ ]:
df_test.isna().sum()

PassengerId      0
Pclass           0
Name             0
Sex              0
Age             86
SibSp            0
Parch            0
Ticket           0
Fare             1
Cabin          327
Embarked         0
dtype: int64

In [ ]:
df_test = df_test.drop(columns = ['PassengerId','Name','Cabin','Ticket'])

In [ ]:
df_test

     Pclass     Sex   Age  SibSp  Parch      Fare Embarked
0         3    male  34.5      0      0    7.8292        Q
1         3  female  47.0      1      0    7.0000        S
2         2    male  62.0      0      0    9.6875        Q
3         3    male  27.0      0      0    8.6625        S
4         3  female  22.0      1      1   12.2875        S
..      ...     ...   ...    ...    ...       ...      ...
413       3    male   NaN      0      0    8.0500        S
414       1  female  39.0      0      0  108.9000        C
415       3    male  38.5      0      0    7.2500        S
416       3    male   NaN      0      0    8.0500        S
417       3    male   NaN      1      1   22.3583        C

[418 rows x 7 columns]

In [ ]:
df_test.describe()

           Pclass         Sex         Age  ...       Parch        Fare    Embarked
count  418.000000  418.000000  418.000000  ...  418.000000  418.000000  418.000000
mean     2.265550    0.363636   28.364833  ...    0.392344   35.560497    1.464115
std      0.841838    0.481622   13.180116  ...    0.981429   55.857145    0.685516
min      1.000000    0.000000    0.170000  ...    0.000000    0.000000    1.000000
25%      1.000000    0.000000   21.000000  ...    0.000000    7.895800    1.000000
50%      3.000000    0.000000   24.000000  ...    0.000000   14.454200    1.000000
75%      3.000000    1.000000   35.750000  ...    0.000000   31.471875    2.000000
max      3.000000    1.000000   76.000000  ...    9.000000  512.329200    3.000000

[8 rows x 7 columns]

In [ ]:
for col in df_test:
  print(col + '\t' + str(df_test[col].nunique()))

Pclass	3
Sex	2
Age	79
SibSp	7
Parch	8
Fare	169
Embarked	3

In [ ]:
df_test['Fare'] = imputer.fit_transform(np.reshape(df_test['Fare'].values, (-1,1)))
df_test['Age'] = imputer.fit_transform(np.reshape(df_test['Age'].values, (-1,1)))

In [ ]:
df_test.isna().sum()

Pclass      0
Sex         0
Age         0
SibSp       0
Parch       0
Fare        0
Embarked    0
dtype: int64

In [ ]:
df_test['Sex'] = df_test['Sex'].map(sex_mapping)
df_test['Embarked'] = df_test['Embarked'].map(embarked_mapping)

In [ ]:
df_test

     Pclass  Sex   Age  SibSp  Parch      Fare  Embarked
0         3    0  34.5      0      0    7.8292         3
1         3    1  47.0      1      0    7.0000         1
2         2    0  62.0      0      0    9.6875         3
3         3    0  27.0      0      0    8.6625         1
4         3    1  22.0      1      1   12.2875         1
..      ...  ...   ...    ...    ...       ...       ...
413       3    0  21.0      0      0    8.0500         1
414       1    1  39.0      0      0  108.9000         2
415       3    0  38.5      0      0    7.2500         1
416       3    0  21.0      0      0    8.0500         1
417       3    0  21.0      1      1   22.3583         2

[418 rows x 7 columns]

In [ ]:
df_test[['Age', 'Fare', 'Parch', 'SibSp']] = sc.fit_transform(df_test[['Age', 'Fare', 'Parch', 'SibSp']])

In [ ]:
df_test

     Pclass  Sex       Age     SibSp     Parch      Fare  Embarked
0         3    0  0.466044 -0.499470 -0.400248 -0.497063         3
1         3    1  1.415579  0.616992 -0.400248 -0.511926         1
2         2    0  2.555021 -0.499470 -0.400248 -0.463754         3
3         3    0 -0.103676 -0.499470 -0.400248 -0.482127         1
4         3    1 -0.483490  0.616992  0.619896 -0.417151         1
..      ...  ...       ...       ...       ...       ...       ...
413       3    0 -0.559453 -0.499470 -0.400248 -0.493105         1
414       1    1  0.807877 -0.499470 -0.400248  1.314557         2
415       3    0  0.769896 -0.499470 -0.400248 -0.507445         1
416       3    0 -0.559453 -0.499470 -0.400248 -0.493105         1
417       3    0 -0.559453  0.616992  0.619896 -0.236640         2

[418 rows x 7 columns]

In [ ]:
prediction = sv.predict(df_test)

In [ ]:
output = pd.DataFrame({'PassengerId': df_test2.PassengerId, 'Survived': prediction})

In [ ]:
output.to_csv('my_submission.csv', index= False)

In [ ]:
x_train, x_test, y_train, y_test = train_test_split(X, Y, test_size = 0.2, random_state = 42)

In [ ]:
print(x_train.shape)
print(x_test.shape)
print(y_train.shape)
print(y_test.shape)

(712, 7)
(179, 7)
(712,)
(179,)

In [ ]:
print(x_train)

     Pclass  Sex       Age  SibSp  Parch      Fare  Embarked
331       1    0  1.283567      0      0 -0.074583       1.0
733       2    0 -0.421991      0      0 -0.386671       1.0
382       3    0  0.260233      0      0 -0.488854       1.0
704       3    0 -0.194583      1      0 -0.490280       1.0
813       3    1 -1.710635      4      2 -0.018709       1.0
..      ...  ...       ...    ...    ...       ...       ...
106       3    1 -0.573596      0      0 -0.494391       1.0
270       1    0 -0.346188      0      0 -0.024246       1.0
860       3    0  0.942456      2      0 -0.364355       1.0
435       1    1 -1.104214      1      2  1.767741       1.0
102       1    0 -0.573596      0      1  0.907738       1.0

[712 rows x 7 columns]

In [ ]:
sv = svm.SVC()

In [ ]:
x_train

     Pclass  Sex       Age  SibSp  Parch      Fare  Embarked
331       1    0  1.283567      0      0 -0.074583       1.0
733       2    0 -0.421991      0      0 -0.386671       1.0
382       3    0  0.260233      0      0 -0.488854       1.0
704       3    0 -0.194583      1      0 -0.490280       1.0
813       3    1 -1.710635      4      2 -0.018709       1.0
..      ...  ...       ...    ...    ...       ...       ...
106       3    1 -0.573596      0      0 -0.494391       1.0
270       1    0 -0.346188      0      0 -0.024246       1.0
860       3    0  0.942456      2      0 -0.364355       1.0
435       1    1 -1.104214      1      2  1.767741       1.0
102       1    0 -0.573596      0      1  0.907738       1.0

[712 rows x 7 columns]

In [ ]:
sv.fit(x_train,y_train)
predict = sv.predict(x_test)

In [ ]:
from sklearn.metrics import confusion_matrix, classification_report

In [ ]:
print(classification_report(y_test,predict))

              precision    recall  f1-score   support

           0       0.82      0.88      0.85       105
           1       0.81      0.73      0.77        74

    accuracy                           0.82       179
   macro avg       0.81      0.80      0.81       179
weighted avg       0.82      0.82      0.81       179

In [ ]:
from sklearn.ensemble import RandomForestClassifier

In [ ]:
rfc = RandomForestClassifier()

rfc = rfc.fit(x_train,y_train)
prdc = rfc.predict(x_test)

In [ ]:
print(classification_report(y_test,prdc))

              precision    recall  f1-score   support

           0       0.83      0.85      0.84       105
           1       0.78      0.76      0.77        74

    accuracy                           0.81       179
   macro avg       0.80      0.80      0.80       179
weighted avg       0.81      0.81      0.81       179

In [ ]:
import tensorflow as tf

In [ ]:
#we build our model
model = tf.keras.models.Sequential()
model.add(tf.keras.layers.Dense(128, activation = tf.nn.relu, input_shape=(712, 7)))
model.add(tf.keras.layers.Dense(128, activation = tf.nn.relu))
model.add(tf.keras.layers.Dense(64, activation = tf.nn.relu))
model.add(tf.keras.layers.Dense(32, activation = tf.nn.relu))
model.add(tf.keras.layers.Dense(1, activation = tf.nn.sigmoid))

In [ ]:
model.compile(optimizer= 'adam',
              loss = 'binary_crossentropy',
              metrics = ['accuracy'])

In [ ]:
model.summary()

Model: "sequential_1"
_________________________________________________________________
Layer (type)                 Output Shape              Param #
=================================================================
dense_5 (Dense)              (None, 712, 128)          1024
_________________________________________________________________
dense_6 (Dense)              (None, 712, 128)          16512
_________________________________________________________________
dense_7 (Dense)              (None, 712, 64)           8256
_________________________________________________________________
dense_8 (Dense)              (None, 712, 32)           2080
_________________________________________________________________
dense_9 (Dense)              (None, 712, 1)            33
=================================================================
Total params: 27,905
Trainable params: 27,905
Non-trainable params: 0
_________________________________________________________________

In [ ]:
model.fit(x_train, y_train, epochs = 20)

Epoch 1/20
WARNING:tensorflow:Model was constructed with shape (None, 712, 7) for input KerasTensor(type_spec=TensorSpec(shape=(None, 712, 7), dtype=tf.float32, name='dense_5_input'), name='dense_5_input', description="created by layer 'dense_5_input'"), but it was called on an input with incompatible shape (None, 7).
WARNING:tensorflow:Model was constructed with shape (None, 712, 7) for input KerasTensor(type_spec=TensorSpec(shape=(None, 712, 7), dtype=tf.float32, name='dense_5_input'), name='dense_5_input', description="created by layer 'dense_5_input'"), but it was called on an input with incompatible shape (None, 7).
23/23 [==============================] - 0s 2ms/step - loss: 0.6435 - accuracy: 0.6587
Epoch 2/20
23/23 [==============================] - 0s 3ms/step - loss: 0.5201 - accuracy: 0.7584
Epoch 3/20
23/23 [==============================] - 0s 2ms/step - loss: 0.5034 - accuracy: 0.7584
Epoch 4/20
23/23 [==============================] - 0s 2ms/step - loss: 0.4313 - accuracy: 0.8258
Epoch 5/20
23/23 [==============================] - 0s 2ms/step - loss: 0.4278 - accuracy: 0.8188
Epoch 6/20
23/23 [==============================] - 0s 2ms/step - loss: 0.4223 - accuracy: 0.8230
Epoch 7/20
23/23 [==============================] - 0s 3ms/step - loss: 0.4095 - accuracy: 0.8385
Epoch 8/20
23/23 [==============================] - 0s 3ms/step - loss: 0.4005 - accuracy: 0.8272
Epoch 9/20
23/23 [==============================] - 0s 3ms/step - loss: 0.4078 - accuracy: 0.8385
Epoch 10/20
23/23 [==============================] - 0s 3ms/step - loss: 0.4038 - accuracy: 0.8413
Epoch 11/20
23/23 [==============================] - 0s 3ms/step - loss: 0.3958 - accuracy: 0.8441
Epoch 12/20
23/23 [==============================] - 0s 2ms/step - loss: 0.3890 - accuracy: 0.8441
Epoch 13/20
23/23 [==============================] - 0s 2ms/step - loss: 0.3898 - accuracy: 0.8329
Epoch 14/20
23/23 [==============================] - 0s 2ms/step - loss: 0.3921 - accuracy: 0.8455
Epoch 15/20
23/23 [==============================] - 0s 3ms/step - loss: 0.4058 - accuracy: 0.8357
Epoch 16/20
23/23 [==============================] - 0s 3ms/step - loss: 0.3871 - accuracy: 0.8413
Epoch 17/20
23/23 [==============================] - 0s 3ms/step - loss: 0.3743 - accuracy: 0.8511
Epoch 18/20
23/23 [==============================] - 0s 2ms/step - loss: 0.3867 - accuracy: 0.8399
Epoch 19/20
23/23 [==============================] - 0s 3ms/step - loss: 0.3840 - accuracy: 0.8441
Epoch 20/20
23/23 [==============================] - 0s 3ms/step - loss: 0.3830 - accuracy: 0.8427

In [ ]:
model.evaluate(x_test,y_test)

WARNING:tensorflow:Model was constructed with shape (None, 712, 7) for input KerasTensor(type_spec=TensorSpec(shape=(None, 712, 7), dtype=tf.float32, name='dense_5_input'), name='dense_5_input', description="created by layer 'dense_5_input'"), but it was called on an input with incompatible shape (None, 7).
6/6 [==============================] - 0s 2ms/step - loss: 0.4396 - accuracy: 0.8045

[0.43964681029319763, 0.8044692873954773]